//#include<stdio.h>
//int main1()
//{	
//	int y,m;
//	int month_1[] = { 31,28,31,30,31,30,31,31,30,31,30,31 };
//	int month_2[] = { 31,29,31,30,31,30,31,31,30,31,30,31 };
//	printf("input the year and month:\n");
//	scanf_s("%d%d", &y,&m);
//	if (y % 4 == 0 && y % 100 != 0 || y % 400 == 0)
//	{
//		if (m == 3 || m == 4 || m == 5)
//		{
//			printf("是闰年，这个月是春天，有%d天", month_1[m - 1]);
//		}
//		if (m == 6 || m == 7 || m == 8)
//		{
//			printf("是闰年，这个月是夏天，有%d天", month_1[m - 1]);
//		}
//		if (m == 9 || m == 10 || m == 11)
//		{
//			printf("是闰年，这个月是秋天，有%d天", month_1[m - 1]);
//		}
//		if (m == 12 || m == 1 || m == 2)
//		{
//			printf("是闰年，这个月是冬天，有%d天", month_1[m - 1]);
//		}
//	}
//	else
//	{
//		if (m == 3 || m == 4 || m == 5)
//		{
//			printf("是闰年，这个月是春天，有%d天", month_2[m - 1]);
//		}
//		if (m == 6 || m == 7 || m == 8)
//		{
//			printf("是闰年，这个月是夏天，有%d天", month_2[m - 1]);
//		}
//		if (m == 9 || m == 10 || m == 11)
//		{
//			printf("是闰年，这个月是秋天，有%d天", month_2[m - 1]);
//		}
//		if (m == 12 || m == 1 || m == 2)
//		{
//			printf("是闰年，这个月是冬天，有%d天", month_2[m - 1]);
//		}
//	}
//	return 0;
//}